
/* mandatory hello world */ 
say "Hello, World!" 

/* using a simple function */
say add(2,2)

/* halts */
exit

/* a function */

add:
parse arg a, b
return a + b

