
Name = "Mike Cowlishaw"
YearThen = 1979
YearNow  = 1979 + 43

say "The REXX language was created by" Name
say "In the year" YearThen
say "And this toy program was written in" YearNow 
say YearNow - YearThen "years appart." 

