       IDENTIFICATION DIVISION.
       AUTHOR. edo9k.
       PROGRAM-ID. PreDefMsg. 

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 PreDefMsg PIC X(21) VALUE 'Hello World of Cobol!'.

       PROCEDURE DIVISION.
       DISPLAY PreDefMsg.
       STOP RUN.


       

