        IDENTIFICATION DIVISION.
        AUTHOR. edo9k.
        PROGRAM-ID. PERFORM-N-TIMES.

        DATA DIVISION.
        WORKING-STORAGE SECTION.
        01 REPEATTIMES PIC 9 VALUE 7.

        PROCEDURE DIVISION.
        DISPLAY "PROGRAM STARTS HERE..."
        PERFORM 5 TIMES
              DISPLAY "[+] THIS INLINE VERSION PRINTED 5 TIMES."
        END-PERFORM
        DISPLAY "DONE WITH INLINE NEXT STOP OUT-OF-LINE..."
        PERFORM SECONDVERSION REPEATTIMES TIMES.
        STOP RUN.

        SECONDVERSION.
        DISPLAY "[-] THIS IS OUT-OFLINE PERFORM PRINTED 7 TIMES.".


