        IDENTIFICATION DIVISION.
        PROGRAM-ID.  perform-ex.
        AUTHOR. edo9k.

        DATA DIVISION.
        WORKING-STORAGE SECTION.
        01 USERINITIALS PIC X(10).
        01 A PIC 999 VALUE 30.
        01 B PIC 999 VALUE 20.
        01 RESULT PIC 999999.
        01 FORMATTED PIC Z(10).Z(2).

        PROCEDURE DIVISION.
        
        FIRSTSTAGE.
        DISPLAY "-----------------"
        DISPLAY "THIS IS THE FIRST STAGE OF THE PROGRAM.".
        DISPLAY "...AND NEXT WE'RE AT???"
        DISPLAY "-----------------"
        PERFORM THIRDSTAGE.
        DISPLAY "-----------------"
        DISPLAY "PREVIOUS ONE WAS THIRD STAGE AND NOW WE'RE AT 1ST.".
        DISPLAY "-----------------"
        STOP RUN.

        SECONDSTAGE.
        DISPLAY "YOU HAVE REACHED SECOND STAGE.".
        DISPLAY "PLEASE ENTER YOUR INITIALS: ".
        ACCEPT USERINITIALS
        DISPLAY "HELLO ", USERINITIALS.
        DISPLAY "I WONDER WHAT'S THE NEXT DESTINATION...".

        THIRDSTAGE.
        DISPLAY "YOU'VE REACHED THE THIRD STAGE (INSTEAD OF THE 2ND).".
        DISPLAY "HERE WE LIKE MATHS.".
        MULTIPLY A BY B GIVING RESULT.
        MOVE RESULT TO FORMATTED.
        DISPLAY "WE MULTIPLIED 30 WITH 20 AND GOT ", FORMATTED.
        DISPLAY "NEXT WE'LL JUMP TO THE SECOND STAGE.."
        DISPLAY "-----------------"
        PERFORM SECONDSTAGE.






