        IDENTIFICATION DIVISION.
        PROGRAM-ID. sequencialfile.
        AUTHOR. edo9k.

        ENVIRONMENT DIVISION.
        INPUT-OUTPUT SECTION.
        FILE-CONTROL.
               SELECT USERDATABASE ASSIGN TO "USERS.DATA"
               ORGANIZATION IS LINE SEQUENTIAL.

        DATA DIVISION.
        FILE SECTION.
        FD USERDATABASE.
        01 USERRECORD.
              88 ENDOFUSERDB VALUE HIGH-VALUES.
              02 USERID     PIC 9(5).
              02 USERNAMES. 
                     03 USERNAME PIC X(5).
                     03 REALNAME PIC X(10).
              02 PASSWORD.
                     03 SALT PIC XX.
                     03 HASH PIC X(5).
              03 COUNTRYCODE PIC XX.

        PROCEDURE DIVISION.

        OPEN OUTPUT USERDATABASE.
        DISPLAY "ENTER USER DETAILS USING THE TEMPLATE."
        DISPLAY "ENTER NO DATA TO END."

        PERFORM GETUSERRECORD
        PERFORM UNTIL USERRECORD = SPACES 
                WRITE USERRECORD
                PERFORM GETUSERRECORD
        END-PERFORM
        CLOSE USERDATABASE

        OPEN INPUT USERDATABASE.
        READ USERDATABASE AT END SET ENDOFUSERDB TO TRUE
        END-READ
        PERFORM UNTIL ENDOFUSERDB
                 DISPLAY USERID SPACE USERNAME SPACE PASSWORD
                 READ USERDATABASE AT END SET ENDOFUSERDB TO TRUE
                 END-READ
        END-PERFORM
        CLOSE USERDATABASE
        STOP RUN.

        GETUSERRECORD.
                 DISPLAY "IIIIIIIIIUUUUURRRSSSPCC"
                 ACCEPT USERRECORD.


